{
  "output": {
    "Commercial Banks": {
      "description": "This is a list of commercial banks with International Authorization in Nigeria, arranged alphabetically. \n A commercial bank is a financial institution which accepts deposits from the public and gives loans for the purposes of consumption and investment to make profit.",
      "banks": {
        "Access Bank Plc": {
          "website": "https://www.accessbankplc.com",
          "image": "https://raw.githubusercontent.com/Axxellance/all-nigeria-banks-ussd-code-json-data/main/imgs/commercial_bank/Access_Bank_Logo.png",
          "description": "Access Bank plc, commonly known as Access Bank, is a Nigerian multinational commercial bank, owned by Access Bank Group. It is licensed by the Central Bank of Nigeria, the national banking regulator. Originally a corporate bank, they expanded into personal and business banking in 2012. \n\nAccess Bank and Diamond Bank merged on April 1, 2019. In conclusion of its merger with Diamond Bank, Access Bank unveiled its new logo, signalling the commencement of a new enlarged banking entity. The bank employs more than 28,000 people in 2021, After the merger, with more than 42 million of customers, Access Bank plc became the largest bank in Africa by customer base, and the largest bank in Nigeria by asset. \n\nAs of September 2021, in addition to Nigeria, Access Bank plc has subsidiaries in Mozambique, Zambia, Congo, Sierra Leone, Rwanda, Gambia, Ghana, Kenya, South Africa, and in the United Kingdom. Access Bank Group also maintains representative offices in China, India, Lebanon and United Arab Emirates.\n\nAttribute: https://en.wikipedia.org",
          "codes": [
            {
              "title": "Access Bank USSD Code Registration",
              "ussd": "*901#",
              "description": "To start using the Access USSD ussd, you’ll need to enroll and activate it on the mobile number linked to your Access bank account. \n\nAccess bank transfer USSD ussd, simply dial *901#, simply follow the steps below: \n\n-Dial *901# with your registered Access bank phone number. \n-Click on ‘Transfer’. \n-Enter the last six (6) digits of your Debit Card number (Note, you will be prompted to input your Date of Birth if you do not have an active debit card). \n-Next, enter your Access account number. \n-Create a 4-digit PIN. \n\nNow you’re done with that Access short ussd registration."
            },
            {
              "title": "Access Bank USSD",
              "ussd": "*901#",
              "description": "Access bank short ussd allows you to perform transactions like transfer money, check account balance, airtime top-up, pay bills, get account statement, BVN, and a lot more. *901# Access USSD ussd is the convenient, secure, and easy way to perform your banking transactions without an internet-enabled device that features an online connection."
            },
            {
              "title": "Access Diamond USSD",
              "ussd": "*426#",
              "description": "Access / Diamond bank short ussd allows you to also perform transactions like transfer money, check account balance, airtime top-up, pay bills, get account statement, BVN, and a lot more, just like the Direct access bank ussd ussd."
            },
            {
              "title": "Self-Service",
              "ussd": "*901*911#",
              "description": "Access Bank Plc launches *901*911# Self-Service USSD to control fraud, this is to safeguard the investments and savings of its customers."
            },
            {
              "title": "Merchant Payment",
              "ussd": "*901*1*Merchant ussd*Amount#",
              "description": "No description available yet :("
            },
            {
              "title": "Self-airtime Purchase",
              "ussd": "*901*Amount#",
              "description": "The Access bank ussd to buy airtime for self is *901*Amount# (example, *901*100#)"
            },
            {
              "title": "Airtime to Others",
              "ussd": "*901*Amount*Phone Number#",
              "description": "Access bank bank ussd to buy airtime for others like friends and family is *901*Amount*Phone Number# (example, *901*100*08012345678#)"
            },
            {
              "title": "Data Purchase",
              "ussd": "*901*8#",
              "description": "Access bank bank ussd to buy data for yourself and others like friends and family is *901*8#"
            },
            {
              "title": "Transfer",
              "ussd": "*901*Amount*Account Number#",
              "description": "To transfer money from Access bank account to other banks in Nigeria using the Access bank transfer ussd, simply dial *901*Amount*Account Number#. \n For example, dial *901*10000*1234567890#, complete the payment by entering your 4 digits security PIN."
            },
            {
              "title": "Check Balance",
              "ussd": "*901*00#",
              "description": "Access bank USSD ussd to check balance is *901*00#. This ussd to check account balance in Access bank is available for all registered customers in Access bank Plc and most be done on their phone number that’s linked to the account."
            },
            {
              "title": "Check BVN",
              "ussd": "*565*0#",
              "description": "The official USSD ussd to check your Access bank BVN is *565*0#. Also, make sure that the phone number you dialed the Access USSD ussd for bank verification number is linked to the account."
            },
            {
              "title": "Check Account Number",
              "ussd": "*901*5#",
              "description": "To check the Access bank account number using USSD ussd, follow the steps below: \n  - Dial *901# with the phone number linked to the Access bank account. \n - On the menu options, select option 4 “Other services” \n - Next, select option 4 again “Enquiry service” \n - Finally, select option 3 “Account Number Enquiry”. \n Alternatively, dial *901*5# with the SIM card used in receiving alert then enter your Access bank USSD security PIN. After this, wait like 1 or 2 seconds your Access bank account number will be fetched from the bank’s server and shown to you."
            },
            {
              "title": "PIN change/reset",
              "ussd": "*901*0#",
              "description": "If you forget your Access USSD security PIN, simply dial *901*0# to get the PIN reset."
            },
            {
              "title": "LCC Toll account top-up",
              "ussd": "*901*000*522+etag number+amount#",
              "description": "No description available yet :("
            },
            {
              "title": "Deactivate phone number on USSD",
              "ussd": "*901*000*522+etag number+amount#",
              "description": "To deactivate phone number on USSD (you can use any phone for this service)"
            },
            {
              "title": "Bill Payments",
              "ussd": "*901*3#",
              "description": "No description available yet :("
            },
            {
              "title": "USSD on POS",
              "ussd": "*901*000*Refussd#",
              "description": "No description available yet :("
            },
            {
              "title": "Diamond Xtra",
              "ussd": "*901*5#",
              "description": "No description available yet :("
            },
            {
              "title": "Payday Loan",
              "ussd": "*901*11#",
              "description": "No description available yet :("
            },
            {
              "title": "Dual Transaction Service (DTS)",
              "ussd": "*901*14#",
              "description": "No description available yet :("
            },
            {
              "title": "Access Africa",
              "ussd": "*901*13#",
              "description": "No description available yet :("
            },
            {
              "title": "Access Yellow",
              "ussd": "*901*10#",
              "description": "No description available yet :("
            },
            {
              "title": "Update customer’s info",
              "ussd": "*901*12#",
              "description": "No description available yet :("
            },
            {
              "title": "Access bank block ussd",
              "ussd": "*901*919#",
              "description": "To lock your Access Bank account during an emergency period like loss of your ATM card, and other valuable bank information, simply dial *901*919#. \n Within 3 minutes after dialing, the account will be locked. You can also call Access bank customer care service on 012802500 and request to block your account. \n Note that you’re only to dial the Access bank account blocking ussd in emergency cases, after exposing your banking details to fraudsters either online or offline. \n Note: Unfortunately, there’s no Access USSD ussd to unlock your Access bank account after it has been locked. Hence, you’re to visit any Access bank branch to get your account to unblock."
            }
          ]
        },
        "Fidelity Bank Plc": {
          "website": "https://www.fidelitybank.ng",
          "image": "https://raw.githubusercontent.com/Axxellance/all-nigeria-banks-ussd-code-json-data/main/imgs/commercial_bank/Fidelity_Bank.png",
          "description": "Fidelity Bank, also known as Fidelity Bank Plc., is a commercial bank in Nigeria. It is licensed as a commercial bank with international authorization, by the Central Bank of Nigeria (CBN), the central bank and national banking regulator. \n\nFidelity Bank has grown from a marginal player in 1987, into a stable and respectable banking institution. Notably in 2005, Fidelity Bank acquired FSB International Bank Plc (“FSB”) and Manny Bank Plc (“Manny”) to create one of the top 10 Nigerian banks. In 2011, the Bank was ranked the 7th most capitalized bank in Nigeria, 25th most capitalized bank on the African continent.\n\n Also, following its renewed retail and digital banking drive, Fidelity Bank was ranked the 4th best bank in Nigeria in the retail market segment in the KPMG Banking Industry Customer Satisfaction Survey (BICSS) in 2017. As of December 2017, Fidelity Bank Plc. had total assets estimated at over US$4.2 billion (NGN:1.4 + trillion), and shareholders' equity in excess of US$610 million (NGN:203 billion).\n\n The Bank serves its 4 + million customers through its multiple distribution channels including 240 business offices, 775 ATMs and 4,346 POSs. The Bank currently has over 400,000 diverse shareholders. It was listed on the Nigerian Stock Exchange in May 2005 and has consistently paid dividends annually in the last 12 years even in the most turbulent periods in the Nigerian Banking Industry.\n\nAccording to BGL Plc, Fidelity Bank Plc had a market capitalisation of NGN:37,072,109,685.76\n\nAttribute: https://en.wikipedia.org",
          "codes": [
            {
              "title": "Fidelity Bank USSD Code Activation",
              "ussd": "*770#",
              "description": "As an individual account holder in Fidelity Bank, you are already profile to be able to use the *770# service. However, you must now activate your access by going through the following steps below if you wish to use the *770# for your day-to-day transactions. \n\nHere are the step-by-step procedures to register on Fidelity Bank *770# USSD code: \n\n-Dial *770*00*#\n-Enter your account number\n-Create PIN\n-Confirm PIN\n-You will be required to enter an alternative phone number. Input ‘0’ if you don’t have one.\n-Enter PIN\n-Submit"
            },
            {
              "title": "Transfer to Other Fidelity Bank Account",
              "ussd": "*770*Destination Account*Amount#",
              "description": "You can transfer your funds to other Fidelity Bank accounts as well as other banks. Here is how to transfer your funds using *770#. You just need to follow any of the two steps below:\n\n-Dial *770#\n-Press ‘1’ to proceed\n-Select ‘4’ from the menu displayed\n-Enter amount\n-Enter destination account number\n-You will be asked if you want to save beneficiary or not\n-Select destination bank\n-Confirm the fee\n-Submit\n\nOR\n\nSimply dial  *770*Destination Account*Amount#\n\nThe fees varies from N0-N5,000 – N10, N5,000 and above – N25"
            },
            {
              "title":"Pay Bills",
              "ussd":"*770*Biller Code*Amount#",
              "description":"You can also use your Fidelity Bank USSD code *770# to pay all your TV, electricity, and all other utility bills. Easy and convenient.\n\n-Dial *770#\n-Choose Pay bills\n-Choose the biller name\n-Choose your plan\n-Enter amount\n-Submit\n\nYou can do this up here or simply dial *770*Biller Code*Amount#\n\nNote that this will cost you N105"
            },
            {
              "title":"Self Recharge",
              "ussd":"*770*Amount#",
              "description":"You can load airtime for your self, simple follow this procedure:\n\n-Dial *770#\n-Choose Airtime\n-Enter Your phone’\n-Enter amount\n\nYou can also load airtime by dialing *770*AMOUNT#"
            },
            {
              "title":"Recharge for Others",
              "ussd":"*770*Phone Number*Amount#",
              "description":"You can load airtime for others, simple follow this procedure:\n\n-Dial *770#\n-Choose Airtime\n-Enter their phone’\n-Enter amount\n\nYou can also load airtime by dialing *770*PHONE NUMBER*AMOUNT#"
            },
            {
              "title":"Check Balance",
              "ussd":"*770*0#",
              "description":"How to Check Balance on Fidelity Bank:\n\n-Dial *770*0#\n-Choose Balance\n-Enter PIN\n\nyou can also check your balance by dialing *770*0#\n\nNote that this will cost you N20"
            },
            {
              "title":"Open a Fidelity Bank Account",
              "ussd":"*770*01#",
              "description":"If you are not yet a fidelity bank account user, you can open a fidelity bank account with on your phone, simply dial *770*01# and follow the on screen message:\n\n-Select an account opening option (Select Option 1 if you have your BVN and Option 2 if you don’t)\n-Enter your first name First Name\n-Enter your middle name\n-Enter your last name\n-Select your gender\n-Enter your account officer code or press ‘0’ if you don’t have one\n-Enter your date of birth\n-Press 1 to confirm your details and proceed\n\nBut you will still have to go to their bank to complete your registration"
            },
            {
              "title":"Block Card",
              "ussd":"*770*911#",
              "description":"If you lost your credit card or it got stolen, then you can block your credit card using the above USSD code"
            },
            {
              "title":"Get Aaccount Number/BVN",
              "ussd":"*770*5#",
              "description":"If you need to check your account number or your BVN, simple use this USSD code above"
            },
            {
              "title":"Cardless Withdrawal",
              "ussd":"*770*8*Amount#",
              "description":"If by chance you find your self without your ATM card and you want to make a withdraw, then this code is what you will need"
            },
            {
              "title":"Change PIN",
              "ussd":"*770*00#",
              "description":"Use this code above to change your USSD bank PIN"
            },{
              "title":"Account Blocking",
              "ussd":"*770*Phone Number#",
              "description":""
            }
          ]
        },
        "First City Monument Bank Limited": {
          "website": "https://www.fcmb.com",
          "image": "https://raw.githubusercontent.com/Axxellance/all-nigeria-banks-ussd-code-json-data/main/imgs/commercial_bank/FCMB_Logo.png",
          "description": "First City Monument Bank (FCMB), a member of FCMB Group Plc, is a financial services holding company headquartered in Lagos. \n\nFCMB Group Plc has nine subsidiaries divided among three business groups: commercial and retail banking, investment banking, and asset and wealth management. As of December 2020, the Group's total assets were valued at US $5 billion (NGN: 2 trillion). \n\nThe entity from which the bank was founded, City Securities Limited (CSL), was established in 1977 by Oloye Subomi Balogun, the Otunba Tunwashe of Ijebu, a Yoruba traditional aristocrat. \n\nFirst City Merchant Bank was established in 1982 with seed capital from CSL. It was incorporated as a private limited liability company on 20 April 1982 and granted a banking license on 11 August 1983. It was the first bank to be established in Nigeria without government or foreign support. \n\nIn 2001, the name of the bank was changed from First City Merchant Bank to First City Monument Bank Limited following the bank's transformation to a universal bank. A new subsidiary, FCMB Capital Markets Limited, was formed to support its corporate finance activities. \n\nOn 15 July 2004, FCMB changed its status from a private limited liability company to a public limited liability company and was listed on the Nigerian Stock Exchange (NSE) by introduction on 21 December 2004.\n\nAttribute: https://en.wikipedia.org",
          "codes": [
            {
              "title":"How to Enroll for FCMB USSD Code",
              "ussd":"*329#",
              "description":"FCMB USSD is available to all Retail and Personal Business Account customers of FCMB. When interested, users must register to get started by dialing *329#.\n\n-Dial *329#, register using any phone type and sim that link to bank account\n-Follow the prompts message\n-Enter your Debit or ATM card last digits\n-Create 4 digits secret Pin."
            },
            {
              "title":"How to Create FCMB Transaction Code/PIN",
              "ussd":"*329*0#",
              "description":"How to Enroll/Activate/Reset FCMB Transaction Code to transfer up to N500,000.00 daily\n\n-Dial *329*0#\n-Select Create/Reset code\n-Select your ATM Card (for customers with multiple cards)\n-Enter your ATM Card PIN\n-Create a 4-digit Transaction Code, e.g., 1234\n-Enter your USSD PIN\n-Transaction code created successfully"
            },
            {
              "title":"How to transfer money to FCMB",
              "ussd":"*329*Amount*Account number#",
              "description":"To transfer money from your FCMB account to other FCMB bank in Nigeria dial the following code from your register phone that is link to your bank account\n\n-Dial *329*Amount*Account number# to transfer funds.\n\nExample:{*329*3000*4012345679#} Also you can Dial *329# and follow the prompt message"
            },
            {
              "title":"Buy Airtime for Self",
              "ussd":"*329*Amount#",
              "description":"Dial*329*Amount# to buy airtime for your FCMB registered mobile phone."
            },
            {
              "title":"Buy Airtime for Others",
              "ussd":"*329*Amount*Mobile number#",
              "description":"Dial *329*Amount*Mobile number# to buy airtime other mobile phones."
            },
            {
              "title":"Buy But Electricity Bill",
              "ussd":"*329*3*Amount*Meter No#",
              "description":"Dial *329*3*Amount*Meter No# or *329*3*Amount*AccountID# to make your electricity bill payments."
            },
            {
              "title":"How to Check Balance",
              "ussd":"*329*00#",
              "description":"Dial *329*00# to check balance"
            },
            {
              "title":"How to Buy Data on Any Phone",
              "ussd":"*329*1*Mobile Number#",
              "description":"Dial *329*1*Mobile Number# to buy data on any phone."
            },
            {
              "title":"Pay for DSTv or GOTv Subscription",
              "ussd":"*329*2*Amount*Smartcard Number#",
              "description":"Dial *329*2*Amount*Smartcard Number# to pay for DSTv or GOTv subscription."
            },
            {
              "title":"How to Pay Bills",
              "ussd":"*329#",
              "description":"Dial *329# and choose Pay Bills. "
            },
            {
              "title":"Block Debit Card",
              "ussd":"*329#",
              "description":"-Dial *329#\n-select self-service\n-select block card"
            },
            {
              "title":"Block Account Number",
              "ussd":"*329#",
              "description":"-Dial *329#\n-select self-service\n-select block account to block account"
            },
            {
              "title":"Block USSD Profile OR Bank Account",
              "ussd":"*329*911#",
              "description":"Simply dial *329*911# from either Registered or Unregistered number.\n\n-Dial *329*911#\n-Select 1 for USSD Account\n-Select 2 for Bank Account\n-Enter Mobile Number or Bank Account Number\n-Confirm blocking of displayed Mobile Number/Bank Account and enter USSD 4 digit PIN\n\nAttribute https://www.fcmb.com/ussd"
            },
            {
              "title":"Link BVN",
              "ussd":"*329#",
              "description":"-Dial *329#\n-select self-service\n-select link BVN to link BVN"
            },
            {
              "title":"Get Statement of Account",
              "ussd":"*329#",
              "description":"-Dial *329#\n-select statement\n-select full statement\n-then select duration (up to 6 months)\n\nYour statement will be sent to your registered email address instantly."
            },
            {
              "title":"How to View Recent Transaction",
              "ussd":"*329#",
              "description":"-Dial *329#\n-select statement\n-select mini statement to view your last five (5) transactions instantly."
            }
          ]
        },
        "First Bank of Nigeria Limited": {
          "website": "https://www.firstbanknigeria.com",
          "image": "https://raw.githubusercontent.com/Axxellance/all-nigeria-banks-ussd-code-json-data/main/imgs/commercial_bank/First_Bank_of_Nigeria_logo.png",
          "description": "First Bank of Nigeria Limited (First Bank) is a Nigerian multinational bank and financial services company headquartered in Lagos, Nigeria. It is the premier bank in West Africa. \n\nFirst Bank of Nigeria Limited operates as a parent company in Nigeria, with the subsidiaries 'FBN Bank' in the Republic of Congo, Ghana, The Gambia, Guinea, Sierra-Leone and Senegal; FBN Bank UK Limited in the United Kingdom with a branch in Paris; First Bank Representative Office in Beijing to capture trade-related business between geographies. \n\nFirst Bank also operates First Pension Custodian Nigeria Limited, Nigeria’s foremost pension custodian. The teeming customers of the First Bank Group are serviced from a network of over 700 business locations across Africa. \n\nTo promote financial inclusion and reach the unbanked, First Bank has an extensive Agent Banking network, with over 53,000 locations across Nigeria. \n\nThe Bank specializes in retail banking and has the largest client base in West Africa, with over 18 million customers. For eight consecutive years (2011 - 2018) First Bank Nigeria received the Best Retail Bank in Nigeria award by The Asian Banker. \n\nFirst Bank as a Group employs over 16,000 staff, and owns a multiple 'Best Place to Work awardee'. It operates four key Strategic Business Units (SBUs) – Retail Banking, Corporate Banking, commercial Banking, and Public Sector Banking. \n\nIt was previously structured as an operating holding company before the implementation of a non-operating Holding Company structure (FBN Holdings) in 2011/2012.\n\nAttribute: https://en.wikipedia.org",
          "codes": [
            {
              "title":"Activate FirstBank USSD Code",
              "ussd":"*894*0#",
              "description":"To activate FirstBank USSD quick banking service is quite easy. Simply follow the guidelines below to learn how to register and activate this mobile banking service:\n\n-Dial *894*0# and a list of masked debit card numbers linked to your account will be displayed\n-Select your preferred debit card\n-Enter the 4-digit Personal Identification Number (PIN) for the selected debit card\n-Create a new 5-digit PIN and your USSD code for First Bank registration is complete.\n\nAttribute: https://www.scholarshipair.com"
            },
            {
              "title":"How to Transfer Money",
              "ussd":"*894*Amount*Account Number#",
              "description":"As long as you are registered for FirstBank USSD transfer, you can use this FirstBank transfer code without ATM or the mobile app. All you have to do is dial the FirstBank USSD transfer code. \n\nThe code to transfer money from first bank to other banks, or other FirstBank accounts is *894*Amount*Account Number#. Follow the next instructions by selecting the beneficiary bank, confirming the amount, beneficiary name and entering your five-digit PIN. \n\nFor example, dial *894*7000*0123456789# to transfer 7,000 naira to 0123456789. Please make sure that you enter the correct beneficiary details including account number, bank name and your transfer pin to validate the transaction. \n\nNote: The USSD code for FirstBank transfer to other banks is the same code to transfer money from FirstBank to other FirstBank accounts.\n\nAttribute: https://www.scholarshipair.com"
            },
            {
              "title":"Link Your BVN to Firstbank",
              "ussd":"*894*BVN# ",
              "description":"If you haven't linked your BVN to your First Bank account, the easiest and most suitable way to do this is by dialing the official USSD code on your mobile phone.\n\nFollow these easy steps to link your BVN to your First Bank account on your phone:\n\n-Ensure that you use the mobile number used during bank account registration.\n-Dial *894*BVN# For example, if your BVN is 57370, then you will have to dial *894*57370#\n-You will receive a message from First Bank on your mobile phone confirming that you have linked your BVN to your First Bank account successfully.\n\nAttribute: https://www.scholarshipair.com"
            },
            {
              "title":"Check BVN Details",
              "ussd":"*565*0#",
              "description":"If you have linked your BVN to your First Bank account, and you need to see your BVN details, you can simply dial *565*0# which is the USSD code for BVN FirstBank, on any mobile device to access your BVN details.\n\nAttribute: https://www.scholarshipair.com"
            },
            {
              "title":"How to Check Balance",
              "ussd":"*894*00#",
              "description":"You may need to check your account balance to be sure of the exact figures you have in your account sometimes, and you can do this by dialing the FirstBank account balance USSD code. Some people even go as far queuing up to use ATM machines just to see their balance, when they can simply dial the FirstBank USSD code to check account balance. \n\nThe FirstBank USSD code for account balance is supported by all Nigerian mobile network. All you have to do is dial the FirstBank USSD balance check code from an account linked phone number. \n\nTo do this, dial *894*00# which is the code to check FirstBank account balance, and follow the instructions displayed on your screen. Then your account balance will be sent to you via SMS. \n\nNote: The USSD code for FirstBank account balance can only be dialed from a registered phone number that is linked to your FirstBank account, and this service incurs charges.\n\nAttribute: https://www.scholarshipair.com"
            },
            {
              "title":"FirstBank Loan USSD Code",
              "ussd":"*894*11# ",
              "description":"Did you know that there is a USSD code to borrow money from FirstBank? If you need money to finance your business, or start up a building project, you can request a quick cash loan from First Bank by dialing the USSD code for FirstBank loan. \n\nFirstBank is one of the top banks in Nigeria that offers instant cash bank loans without paperwork or collateral with a low interest rates, and enables easy access to this service by dialing the FirstBank USSD code for loan. \n\nTo apply for any loan from FirstBank, simply dial the FirstBank USSD loan code *894*11# to get started. It's that easy! \n\nYou can also follow these steps to borrow money from FirstBank:\n\n-Dial the code *894#\n-select 3 (Get Loans)\n-The next menu will show your eligible loan amount\n-Type your desired amount and send\n-Interest rate, management fees and Insurance will be displayed\n-Input five digit transaction PIN to accept terms and conditions\n-The loan will then be disbursed into your salary account as soon as possible. \n\nNote: Your bank account must be a salary account that must have received salary for at least 6 months for you to be eligible for a loan from First Bank Nigeria PLC.\n\nAttribute: https://www.scholarshipair.com"
            },
            {
              "title":"FirstBank Account Opening",
              "ussd":"*894*0#",
              "description":"Follow the step-by-step guidelines below to open a FirstBank account on your phone:\n\n-Dial *894*0# with the phone number linked to your First Bank account\n-a list of masked debit card numbers linked to your account will be displayed on the new screen\n-Select your preferred debit card from the list\n-Enter the 4-digit Personal Identification Number (PIN) for the selected debit card\n-Create a new 5-digit PIN that will he used to confirm and authenticate your transactions, and you have successfully opened a First Bank account on your phone.\n\nAttribute: https://www.scholarshipair.com"
            },
            {
              "title":"Block ATM Card",
              "ussd":"",
              "description":"In cases of unauthorized withdrawal of funds from your account, or even displacing your ATM card might require you to take action by blocking your ATM card. However, for First Bank costumers, this comes in handy as you can do this by sending an SMS. All you have to do is send “BLOCK” to 30012 through SMS alert. \n\nThis SMS must be sent from the phone number linked to the affected bank account. Within 24 hours your ATM card will be blocked and you won't be able to withdraw or make payment with it again.\n\nAttribute: https://www.scholarshipair.com"
            },
            {
              "title":"Buy Airtime for Self",
              "ussd":"*894*Amount#",
              "description":"Still on the 894 experience, you might need to purchase airtime for yourself or for friends and family. \n\nTo purchase airtime for yourself, simply dial the FirstBank airtime transfer code. Dial *894*Amount# to recharge for self. For example; *894*1000#, to buy 1000 naira airtime for your mobile number registered with FirstBank account.\n\nAttribute: https://www.scholarshipair.com"
            },
            {
              "title":"Buy Airtime for Others",
              "ussd":"*894*Amount*Phone Number#",
              "description":"Still on the 894 experience, you might need to purchase airtime for yourself or for friends and family. \n\nTo recharge for others, dial *894*Amount*Phone Number# and enter five-digit PIN. For example; *894*1000*08012345678# and enter your five-digit PIN.\n\nAttribute: https://www.scholarshipair.com"
            },
            {
              "title":"USSD Code for DStv Subscription",
              "ussd":"*894*3*SmartCard Number#",
              "description":"If your DStv subscription expires, there's no cause for alarm, as you can easily pay for it through FirstBank's 894 USSD code. \n\nTo top up subscription payments for your DStv cable service, simply dial *894*3*SmartCard Number# and follow the on-screen instructions.\n\nAttribute: https://www.scholarshipair.com"
            },
            {
              "title":"USSD Code for GOtv Subscription",
              "ussd":"*894*3*IUC Number#",
              "description":"Just as in the case of DStv subscription payments, you can also dial the FirstBank GOtv subscription code to make GOtv subscription payments through FirstBank 894 USSD code. \n\nTo make payments for your GOtv cable service, dial *894*3*IUC Number# and follow the on-screen instructions.\n\nAttribute: https://www.scholarshipair.com"
            },
            {
              "title":"USSD Code for Bet9ja",
              "ussd":"*894#",
              "description":"This section is for FirstBank costumers who also are football lovers seeking to gain reward for passion, but do not know that there's an easy way to fund their bet account without going to the bank. \n\nFunding your Bet9ja account using the First Bank USSD code makes it easy for you to deposit money into your Bet9ja account without the need to visit any FirstBank branch. \n\nTo fund your Bet9ja account, simply dial *894#, select pay merchant (Bet9ja/Lotto); enter your Bet9ja User ID; and input the amount. It's that simple.\n\nAttribute: https://www.scholarshipair.com"
            }
          ]
        },
        "Guaranty Trust Holding Company Plc": {
          "website": "https://www.gtbank.com",
          "image": "https://raw.githubusercontent.com/Axxellance/all-nigeria-banks-ussd-code-json-data/main/imgs/commercial_bank/Gtco_logo-generic.png",
          "description": "Guaranty Trust Holding Company PLC also known as GTCO PLC is a multinational financial services group, that offers retail and investment banking, pension management, asset management and payments services, headquartered in Victoria Island, Lagos. \n\nGTCO Plc was created in July 2021 following the corporate reorganization of Guaranty Trust Bank PLC into a Holding Company GTCO Plc's reorganisation means it will now offer more services beyond banking; with a payments business being top of mind for the group. \n\nUnder its old structure, it could not have run non-lending businesses because a 2010 regulation by the Central Bank of Nigeria (CBN) mandated banks to stop operating their non-banking subsidiaries. They either had to divest from non-core lending service or restructure as a holdings company. \n\nIts new businesses include payments, pension management, asset management, and its existing banking business. GTCO's banking subsidiary in Nigeria, Guaranty Trust Bank Limited is Nigeria’s most valuable bank by market value with its most recent market valuation at N840.26 billion. \n\nGuaranty Trust Holding Plc original started as Guaranty Trust banks and it was founded in 1988 by over 35 young Nigerians in their thirties, spearheaded mostly by Tayo Aderinokun and Fola Adeola, but also included Femi Pedro, Gbolade Osibodu, Femi Akingbe, Akin Opeodu and others.\n\nAttribute: https://en.wikipedia.org",
          "codes": [
            {
              "title":"Open an Account",
              "ussd":"*737*0#",
              "description":"Simply dial *737*0# and follow the onscreen prompts. An account number will be created automatically and sent to you via SMS. \n\nAccount opening forms are NOT required for the signup process. Once you sign up, look out for your ten-digit account number (NUBAN). \n\nYou can also use your phone number as your account number at GTBank branches, GTExpress outlets.\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Reactivate Your Account",
              "ussd":"*737*11#",
              "description":"You can now reactivate your GTBank Account in just 4 easy steps.\n\n-Simply dial *737*11# on your mobile number registered with the Bank.\n-nInput your Bank verification number (BVN)\n-Input Account Officer code (if known) or press 1 to continue\n-To complete your account reactivation, initiate a transaction by buying at least N100 airtime\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Funds Transfer to GTBank Account",
              "ussd":"*737*1*Amount*NUBAN Account Number#",
              "description":"Dial *737*1*Amount*NUBAN Account Number# (e.g. *737*1*1000*1234567890#) from the phone number you registered with GTBank, then follow the on-screen prompts.\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Funds Transfer to Other Banks",
              "ussd":"*737*2*Amount*NUBAN Account Number#",
              "description":"Dial *737*2*Amount*NUBAN Account Number# (e.g. *737*2*1000*1234567890#) from your phone, then authenticate the transfer with 737 PIN created, hardware token or last four digits of your GTBank debit card.\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Top-up Airtime For Self",
              "ussd":"*737*amount# on your phone",
              "description":"Simply dial *737*amount# on your phone (e.g. *737*1000#) to buy airtime.\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Top-up Airtime for Others",
              "ussd":"*737*Amount*Recipient’s number#",
              "description":"To send airtime to a third party or to a friend, simply dial *737*Amount*Recipient’s number# (e.g. *737*1000*08023456789#).\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Data Top-up For Self &  Others",
              "ussd":"*737*4#",
              "description":"Simply dial *737*4# on your phone and follow the on-screen prompt.\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Check Account Details",
              "ussd":"*737*6*1#",
              "description":"To check for the account balances on any of your accounts, your BVN or account number, all you need to do is simply dial; *737*6*1# on your mobile phone and follow the on-screen prompts.\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Create a Transaction PIN",
              "ussd":"*737*5#",
              "description":"You now require a 4-digit PIN to complete your 737 transactions.\n\nHow To:\n\n-Dial *737*5#\n-Input the last 6 digits of your Debit Card\n-Create your 4-digit PIN\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"SKS Standing Instruction",
              "ussd":"*737*52*Amount*26#.",
              "description":"Sometimes life gets so busy that you may forget about the little things that make all the difference; like saving regularly for your child. \n\nFortunately, it’s quite easy to never miss out on saving for your child. All you need to do is place a Standing Instruction for the transfer of any amount from your account to your child’s SKS account and we will do the rest. \n\nYou can set up a standing instruction for your child’s SKS account by using Bank 737 or through Internet Banking.\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"737 Cashout Service",
              "ussd":"*737*50*Amount*50#",
              "description":"Withdraw funds at any TOTAL Service Station\n\nHow to withdraw\n\n-Simply dial *737*50*Amount*50# on your mobile phone.\n-Input the unique Station code (SAP Code)\n-Input *737# PIN or the last 4 digits of debit card to authorize transaction\n-Your account is debited immediately and Total gets credited\n-Both parties receive an SMS and cash is released\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Bill Payment (LCC Toll)",
              "ussd":"*737*50*Amount*108#",
              "description":"You can now top up your LCC Toll account with ease using *737#.\n\nHow to Pay for your LCC Toll\n\n-Simply dial *737*50*Amount*108#\n-Enter your E-Tag code\n-Receive instant value\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Bill Payment (737 Checkout)",
              "ussd":"*737*35*Amount*Merchant Code#",
              "description":"With 737 Checkout, merchant payment is made with ease.\n\nHow to Pay Profiled Merchants\n\nYou can easily pay profiled merchants by simply dialling *737*35*Amount*Merchant Code# e.g. *737*35*1500*0123#.\n\nKindly ask merchant for his/her GTBank merchant code to make payment.\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Bill Payment (Swift Network Subscription)",
              "ussd":"*737*50*Amount*4#",
              "description":"Pay your Swift network subscriptions with ease.\n\nHow to Pay for your Subscription\n\nYou can easily pay your subscriptions from anywhere you are by simply dialling *737*50*Amount*4# e.g. *737*50*7500*4#.\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Bill Payment (Electricity Bills)",
              "ussd":"*737*50*Amount*Biller Code#",
              "description":"Pay your electricity bills with ease.\n\nHow to Pay for your Electricity Bills\n\nYou can now pay your electricity bills anywhere and anytime by simply dialing any of the disco codes below Eg. *737*50*7500*95#.\n\n-Port Harcourt Prepaid: *737*50*Amount*95#\n-Port Harcourt Postpaid: *737*50*Amount*96#\n-Eko Prepaid: *737*50*Amount*151#\n-Eko Postpaid: *737*50*Amount*152#\n-Ibadan Prepaid: *737*50*Amount*137#\n-Kano Prepaid: *737*50*Amount*93#\n-Kano Postpaid: *737*50*Amount*94#\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Bill Payment (StarTimes Subscription)",
              "ussd":"*737*37*Amount*Decoder Number#",
              "description":"Pay your StarTimes cable subscriptions with ease.\n\nHow to pay Subscription\n\nYou can easily pay your subscriptions from anywhere you are by simply dialiing the *737*37*Amount*Decoder Number# e.g. *737*37*2500*00123456789#.\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Airtime Advance",
              "ussd":"*737*8*1#",
              "description":"With the 737 Airtime Advance, you can be rest assured that your important conversations will never be cut short because of lack of airtime. \n\nThe 737 Airtime Advance is open to prequalified GTBank salary account holders who can borrow up to N5,000 airtime and pay at month end.\n\nHow To:\n\nTo request for airtime loan, simply dial *737*8*1# ,follow the prompt and authenticate with the last 4 digits of your GTBank Naira MasterCard\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Salary Advance",
              "ussd":"*737*8*2#",
              "description":"As a pre-qualified salary account holder, you can get up to 50% of your monthly salary as an advance to meet your urgent financial needs.\n\nHow to:\n\nFor Instant access, simply dial *737*8*2# from your registered phone number with the bank to apply.\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Cardless Withdrawal",
              "ussd":"*737*3*Amount#",
              "description":"With Bank 737, your cash withdrawals just got easier.\n\nHow To:\n\n-No GTBank debit card required, simply dial *737*3*Amount# and follow the prompt to generate your withdrawal code and authenticate your request with your 737 created pin.\n\n-Enter the withdrawal code generated into any GTBank ATM to retrieve cash.\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"737 Fast Track Deposit",
              "ussd":"*737*48*Amount*Account Number# ",
              "description":"The 737 Fast Track Deposit enables customers make deposits using the Fast Track points in the Banking Halls without without the need to fill the deposit slip or use a Debit Card.\n\nHow To:\n\nFor Instant access, simply dial *737*48*Amount*Account Number# from your registered phone number with the bank to initiate.\n\nYou can proceed to the bank teller to deposit cash.\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"One Time Password (OTP)",
              "ussd":"*737*7#",
              "description":"You can now generate an OTP using *737*7# to make a quick transaction on-the-go without your banking token.\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Enquiries",
              "ussd":"*737*6#",
              "description":"Simply dial *737*6# to make enquiries on the following:\n\n-Account balances, BVN & Account Number (*737*6*1#)\n-Loan balances (*737*6*2#)\n-Card status (*737*6*3#)\n-Cheque book status (*737*6*4#)\n\nAttribute: https://737.gtbank.com/features"
            },
            {
              "title":"Mini Statement",
              "ussd":"*737*51*30#",
              "description":"\n\nAttribute: https://737.gtbank.com/features"
            }
          ]
        },
        "Union Bank of Nigeria Plc": {
          "website": "https://www.unionbankng.com",
          "image": "https://raw.githubusercontent.com/Axxellance/all-nigeria-banks-ussd-code-json-data/main/imgs/commercial_bank/Union-bank-logo.png",
          "description": "Union Bank of Nigeria Plc is a commercial bank in Nigeria. It has been operating in Nigeria since 1917. \n\nIt's a large commercial bank, serving individuals, small and medium-sized companies, as well as large corporations and organizations. \n\nIn July 2009, it was rated the 556th largest bank in the world and the 14th largest bank in Africa. \n\nAs of Mar 31, 2018, the bank's asset base was estimated at NGN1, 381 billion (US$4.1billion). \n\nThe shareholders' equity at that time was estimated at NGN286 billion (US$851 million).\n\nAttribute: https://en.wikipedia.org",
          "codes": [
            {
              "title":"Check Balance",
              "ussd":"*826*4#",
              "description":"Attribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Buy Airtime for Yourself",
              "ussd":"*826*Amount#",
              "description":"Attribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Buy Airtime for Others",
              "ussd":"*826*Amount*3rd party mobile No#",
              "description":"Attribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Transfer Money to Union Bank",
              "ussd":"*826*1*Amount*Account No#",
              "description":"Attribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Transfer Money to Other Banks",
              "ussd":"*826*2*Amount*Account no#",
              "description":"Attribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Cardless Withdrawal",
              "ussd":"*826*7*amount#",
              "description":"Attribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Locate a Branch/Union Direct Agent",
              "ussd":"*826*19#",
              "description":"Attribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Request a Debit Card",
              "ussd":"*826*21#",
              "description":"Attribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Request a Loan",
              "ussd":"*826*41#",
              "description":"Attribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Data Purchase",
              "ussd":"*826*9#",
              "description":"Attribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Pay Merchants (mCash)",
              "ussd":"*826*22*merchantcode*amount#",
              "description":"Attribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Data Capture After Enrolment",
              "ussd":"*826*3*account no#",
              "description":"Attribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Block and Unblock Card",
              "ussd":"*826*21#",
              "description":"Attribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Limit Increase",
              "ussd":"*826*8#",
              "description":"Attribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Block Your Account",
              "ussd":"*826*6#",
              "description":"Block your account from your phone number\n\nAttribute: https://www.unionbankng.com/personal/826-2/"
            },
            {
              "title":"Block Your Account",
              "ussd":"*826*6*mobile number#",
              "description":"Block your account from other phone numbers\n\nAttribute: https://www.unionbankng.com/personal/826-2/"
            }
          ]
        },
        "United Bank for Africa Plc": {
          "website": "https://www.ubagroup.com",
          "image": "https://raw.githubusercontent.com/Axxellance/all-nigeria-banks-ussd-code-json-data/main/imgs/commercial_bank/United_Bank_logo.png",
          "description": "United Bank for Africa Plc (UBA) is a Multinational pan-African financial services group headquartered in Lagos and known as Africa’s Global Bank. \n\nIt has subsidiaries in 20 African countries and offices in London, Paris and New York. In December 2021, UBA received its banking license to commence operations in the UAE. It is listed as commercial bank by the Central Bank of Nigeria. \n\nThe shares of stock of the group are listed on the Nigerian Stock Exchange, where they trade under the symbol: UBA. The Group Chairman of the bank is Tony Elumelu and the GMD/CEO is Kennedy Uzoka.\n\nAttribute: https://en.wikipedia.org",
          "codes": [
            {
              "title":"",
              "ussd":"",
              "description":""
            }
          ]
        },
        "Zenith Bank Plc": {
          "website": "https://www.ubagroup.com",
          "image": "https://raw.githubusercontent.com/Axxellance/all-nigeria-banks-ussd-code-json-data/main/imgs/commercial_bank/Zenith_Bank_logo.svg.png",
          "description": "Zenith Bank Plc is a large financial service provider in Nigeria and Anglophone West Africa. It is licensed as a commercial bank by the Central Bank of Nigeria, the national banking regulator. As of 31 December 2019, it holds $16.1bn in total assets, with shareholders' equity of $854 million. The company is listed on the Nigeria Stock Exchange and the London Stock Exchange. The founder of Zenith bank plc is Jim Ovia. Zenith Bank was established in May 1990 and commenced banking operations in July of the same year. At inception, it had a capital base of $4 million. It began operations during a period of government liberalization of the banking sector when the central bank granted up to twenty banking licenses a year to investors. The bank's first office was originally a residential house in Victoria Island that was modified into a banking hall. In its early years, the bank witnessed a period of rapid growth. In 1997, following a directive for banking institutions to shore up their capital base, Zenith increased its capitalization to 500 million naira.\n\nAttribute: https://en.wikipedia.org",
          "codes": []
        }
      }
    },
    "Commercial Banks 2": {
      "description": "This is a list of commercial banks with National Authorization in Nigeria, arranged alphabetically. \n A commercial bank is a financial institution which accepts deposits from the public and gives loans for the purposes of consumption and investment to make profit.",
      "banks": {
        "Citibank Nigeria Limited": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Ecobank Nigeria": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Heritage Bank Plc": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Keystone Bank Limited": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Polaris Bank Limited": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Stanbic IBTC Bank Plc": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Standard Chartered": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Sterling Bank Plc": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Titan Trust Bank Limited": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Unity Bank Plc": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Wema Bank Plc": {
          "description": "",
          "image": "",
          "codes": []
        }
      }
    },
    "Commercial Banks 3": {
      "description": "",
      "banks": {
        "Globus Bank Limited": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Parallex Bank Limited": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Providus Bank Limited": {
          "description": "",
          "image": "",
          "codes": []
        },
        "SunTrust Bank Nigeria Limited": {
          "description": "",
          "image": "",
          "codes": []
        }
      }
    },
    "Non-Interest Banks": {
      "description": "",
      "banks": {
        "Jaiz Bank Plc": {
          "description": "",
          "image": "",
          "codes": []
        },
        "LOTUS BANK": {
          "description": "",
          "image": "",
          "codes": []
        },
        "TAJBank Limited": {
          "description": "",
          "image": "",
          "codes": []
        }
      }
    },
    "Microfinance Banks": {
      "description": "",
      "banks": {
        "Mutual Trust Microfinance Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Rephidim Microfinance Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Shepherd Trust Microfinance Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Empire Trust Microfinance Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Finca Microfinance Bank Limited": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Fina Trust Microfinance Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Accion Microfinance Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Peace Microfinance Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Infinity Microfinance Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Pearl Microfinance Bank Limited": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Covenant Microfinance Bank Ltd": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Advans La Fayette Microfinance Bank": {
          "description": "",
          "image": "",
          "codes": []
        }
      }
    },
    "Online-Only Microfinance Banks": {
      "description": "",
      "banks": {
        "Sparkle Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Kuda Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Rubies Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "VFD Microfinance Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Mint Finex MFB": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Mkobo MFB": {
          "description": "",
          "image": "",
          "codes": []
        }
      }
    },
    "Merchant Banks in Nigeria": {
      "description": "",
      "banks": {
        "Coronation Merchant Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "FBNQuest Merchant Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "FSDH Merchant Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Rand Merchant Bank": {
          "description": "",
          "image": "",
          "codes": []
        },
        "Nova Merchant Bank": {
          "description": "",
          "image": "",
          "codes": []
        }
      }
    }
  }
}